src/Documents/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Продажи</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Продажи/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Товар) Тогда
		ТекущиеДанные.Цена = ТоварыТоварПриИзмененииНаСервере(ТекущиеДанные.Товар);
	Иначе
		ТекущиеДанные.Цена = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТоварыТоварПриИзмененииНаСервере(Товар)
	
	Возврат Товар.Цена;

КонецФункции

&НаКлиенте
Процедура РассчитатьСуммуВСтроке(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	
КонецПроцедуры
